
## Plan Result




<pre><code>Plan: 0 to add, 19 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.citizen-notification-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.claim-issue-failure-action-group.azurerm_resource_group_template_deployment.action-group
  * module.cmc-bulk-print-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.cmc-bulk-print-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.cmc-doc-mgt-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.cmc-doc-mgt-failure-action-group.azurerm_resource_group_template_deployment.action-group
  * module.cmc-ff4j-admissions-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.cmc-ff4j-admissions-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.cmc-pdf-fail-action-group.azurerm_resource_group_template_deployment.action-group
  * module.cmc-pdf-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.cmc-vault.azurerm_key_vault.kv
  * module.cmc-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.cmc-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.cmc-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.milo-report-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.milo-report-failure-action-group.azurerm_resource_group_template_deployment.action-group
  * module.ordnance-keys-expired-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.ordnance-survey-keys-expiry-action-group.azurerm_resource_group_template_deployment.action-group


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.cmc_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "cmc_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "cmc-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "cmc-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.bpf_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "bpf_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "bulk-print-failure-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.claim_issue_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "claim_issue_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "claim-issue-failure-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.doc_mgt_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "doc_mgt_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "document-management-failure-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.ff4j_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "ff4j_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ff4j-admissions-failure-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.milo_report_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "milo_report_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "milo-report-failure-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.ordnance_report_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "ordnance_report_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "ordnance-survey-keys-expiry-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.pdf_fail_email_secret will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "pdf_fail_email_secret" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "pdf-failure-email"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat"
        name     = "cmc-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/cmc-shared-infrastructure.git" -> null
            "Team Contact"        = "#cmc-tech"
            "application"         = "civil-money-claims"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/cmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#cmc-tech"
            "environment"         = "staging"
            "managedBy"           = "Money Claims"
        }
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # module.citizen-notification-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/citizen-notification-fail-alert"
        name                = "citizen-notification-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.claim-issue-failure-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/clmisu_alert"
        name                = "clmisu_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-bulk-print-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/BPF_alert"
        name                = "BPF_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-bulk-print-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/cmc-bulk-print-fail-alert"
        name                = "cmc-bulk-print-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-doc-mgt-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/cmc-doc-mgt-fail-alert"
        name                = "cmc-doc-mgt-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-doc-mgt-failure-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/DM_alert"
        name                = "DM_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-ff4j-admissions-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/ff4j_alert"
        name                = "ff4j_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-ff4j-admissions-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/cmc-ff4j-admissions-fail-alert"
        name                = "cmc-ff4j-admissions-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-pdf-fail-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/PDF_alert"
        name                = "PDF_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-pdf-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/cmc-pdf-fail-alert"
        name                = "cmc-pdf-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.cmc-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat"
        name                            = "cmc-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/cmc-shared-infrastructure.git" -> null
            "Team Contact"        = "#cmc-tech"
            "application"         = "civil-money-claims"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/cmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#cmc-tech"
            "environment"         = "staging"
            "managedBy"           = "Money Claims"
        }
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cmc-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)

      - timeouts {}
    }

  # module.cmc-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.KeyVault/vaults/cmc-aat|cmc-aat"
        name                       = "cmc-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cmc-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/cmc-aat-mi"
        name                = "cmc-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/cmc-shared-infrastructure.git" -> null
            "Team Contact"        = "#cmc-tech"
            "application"         = "civil-money-claims"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/cmc-shared-infrastructure.git"
            "businessArea"        = "CFT"
          - "changeUrl"           = "" -> null
            "contactSlackChannel" = "#cmc-tech"
            "environment"         = "staging"
            "managedBy"           = "Money Claims"
        }
        # (5 unchanged attributes hidden)
    }

  # module.milo-report-fail-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/milo-report-fail-alert"
        name                = "milo-report-fail-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.milo-report-failure-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/milo_alert"
        name                = "milo_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.ordnance-keys-expired-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/ordnance-keys-expired-alert"
        name                = "ordnance-keys-expired-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjY21jLXRlY2giLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJNb25leSBDbGFpbXMifQ==" -> "eyJhcHBsaWNhdGlvbiI6ImNpdmlsLW1vbmV5LWNsYWltcyIsImF1dG9TaHV0ZG93biI6InRydWUiLCJidWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvY21jLXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2NtYy10ZWNoIiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiTW9uZXkgQ2xhaW1zIn0="
                }
                # (13 unchanged attributes hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.ordnance-survey-keys-expiry-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/cmc-aat/providers/Microsoft.Resources/deployments/ordn_alert"
        name                = "ordn_alert"
      ~ parameters_content  = (sensitive value)
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

Plan: 0 to add, 19 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":54,"Program":"tfcmt","SHA1":"","Vars":{}} -->